desafio-17-desplegar-nuestro-proyecto-en-la-nube/desafio-16-tests/archivos/test-no-log/artillery-no-log.txt
Phase started: unnamed (index: 0, duration: 1s) 06:48:11(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 06:48:12(-0300)

--------------------------------------
Metrics for period to: 06:48:20(-0300) (width: 1.399s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 720/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 23
  median: ...................................................................... 12.1
  p95: ......................................................................... 16.9
  p99: ......................................................................... 21.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 389.8
  max: ......................................................................... 689.2
  median: ...................................................................... 596
  p95: ......................................................................... 685.5
  p99: ......................................................................... 685.5


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 06:48:14(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 720/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 23
  median: ...................................................................... 12.1
  p95: ......................................................................... 16.9
  p99: ......................................................................... 21.1
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 389.8
  max: ......................................................................... 689.2
  median: ...................................................................... 596
  p95: ......................................................................... 685.5
  p99: ......................................................................... 685.5